{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[BOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[BOS]": {
        "id": "[BOS]",
        "ids": [
          2
        ],
        "tokens": [
          "[BOS]"
        ]
      },
      "[EOS]": {
        "id": "[EOS]",
        "ids": [
          3
        ],
        "tokens": [
          "[EOS]"
        ]
      },
      "[PAD]": {
        "id": "[PAD]",
        "ids": [
          0
        ],
        "tokens": [
          "[PAD]"
        ]
      },
      "[UNK]": {
        "id": "[UNK]",
        "ids": [
          1
        ],
        "tokens": [
          "[UNK]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[BOS]": 2,
      "[EOS]": 3,
      "+": 4,
      "3": 5,
      ":": 6,
      "=": 7,
      "BigA": 8,
      "BigB": 9,
      "BigC": 10,
      "BigD": 11,
      "BigE": 12,
      "BigF": 13,
      "BigG": 14,
      "BigH": 15,
      "BigI": 16,
      "BigJ": 17,
      "BigK": 18,
      "BigL": 19,
      "BigM": 20,
      "BigN": 21,
      "BigO": 22,
      "BigP": 23,
      "BigQ": 24,
      "BigR": 25,
      "BigS": 26,
      "BigT": 27,
      "BigU": 28,
      "BigV": 29,
      "BigW": 30,
      "BigX": 31,
      "BigY": 32,
      "BigZ": 33,
      "CapitalGamma": 34,
      "CapitalLambda": 35,
      "Dagger": 36,
      "Earth": 37,
      "Female": 38,
      "Fire": 39,
      "Infinity": 40,
      "Integral": 41,
      "LatinLongLigatureFi": 42,
      "LatinSmallLigatureFi": 43,
      "NorthEastArrow": 44,
      "NotEqualTo": 45,
      "PhoenicianLetterPe": 46,
      "RockSalt": 47,
      "Saturn": 48,
      "ScriptSmallG": 49,
      "ScriptSmallZ": 50,
      "SleepingSymbol": 51,
      "SmallDelta": 52,
      "SmallIota": 53,
      "SmallNHook": 54,
      "SmallPi": 55,
      "SquareP": 56,
      "SquaredPlus": 57,
      "SquaredRisingDiagonalSlash": 58,
      "TF": 59,
      "TopHalfIntegral": 60,
      "UpwardsArrow": 61,
      "VerticalLine": 62,
      "a": 63,
      "a^^": 64,
      "b": 65,
      "c": 66,
      "c^.": 67,
      "d": 68,
      "e": 69,
      "e^^": 70,
      "f": 71,
      "g": 72,
      "h": 73,
      "h^.": 74,
      "i": 75,
      "i^^": 76,
      "j": 77,
      "k": 78,
      "l": 79,
      "m": 80,
      "m^.": 81,
      "m__": 82,
      "n": 83,
      "n^.": 84,
      "n__": 85,
      "o": 86,
      "o^.": 87,
      "o^^": 88,
      "p": 89,
      "p^.": 90,
      "q": 91,
      "qua": 92,
      "r": 93,
      "r^.": 94,
      "r__": 95,
      "s": 96,
      "s^.": 97,
      "t": 98,
      "u": 99,
      "u^^": 100,
      "u__": 101,
      "v": 102,
      "w": 103,
      "x": 104,
      "x^.": 105,
      "y": 106,
      "y^..": 107,
      "z": 108
    },
    "unk_token": "[UNK]"
  }
}